IDEA StatiCa Open Model
MatPrestressSteelEc2.SurfaceCharacteristic Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Surface characteristic
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public SurfaceCharacteristicType SurfaceCharacteristic { get; set; }
Public Property SurfaceCharacteristic As SurfaceCharacteristicType
	Get
	Set
public:
property SurfaceCharacteristicType SurfaceCharacteristic {
	SurfaceCharacteristicType get ();
	void set (SurfaceCharacteristicType value);
}
Property Value
Type: SurfaceCharacteristicType
See Also
Reference
MatPrestressSteelEc2 Class
IdeaRS.OpenModel.Material Namespace